[{"Images":["MAV_Browse.jpg","MAV_information.jpg","MAV_userlist.jpg","MAV_video.png"],"Title":"MyAnimeViewer","Subtitle":"June 2016 - Current","Description":"MyAnimeViewer is currently a desktop application that strives to make watching and tracking anime easier by taking multiple sources such as AniList.co and Crunchyroll.com and combining them into an easier to use desktop application. Features such as automatically updating your animelist whenever you watch an episode and notifying you when an entry in your plan to watch list goes live or a currently airing series in your currently watching list gets a new episode.\r\n\r\nFeatures that are planned to be released consist of things such as Themes and Styles for the application that can be added and removed (similiar to MyAnimeList's CSS editor) and plugins to allow for sites that don't come as a default for MyAnimeViewer.","BaseURL":"./myanimeviewer/","Href":"https://github.com/Ech0-jp/MyAnimeViewer"},{"Images":["game1.jpg","lose.jpg","newgame.jpg","stats.jpg","win.jpg"],"Title":"Minesweeper","Subtitle":"Web app using React.","Description":"Minesweeper is a single-player puzzle video game. The objective of the game is to clear a rectangular board containing hidden \"mines\" or bombs without detonating any of them, with help from clues about the number of neighboring mines in each field. The game originates from the 1960s, and has been written for many computing platforms in use today.\r\n\r\nJust like the original game, this variation is made using \"React\".","BaseURL":"./minesweeper/","Href":"https://github.com/Ech0-jp/minesweeper"},{"Images":["game1.jpg","game2.jpg","game3.jpg","menu1.jpg","menu2.jpg","stats.jpg","win.jpg"],"Title":"Sudoku","Subtitle":"Android app using Kotlin","Description":"Sudoku is a puzzle that needs little introduction. The object is to put a digit from 1 to N in each cell of the grid so that every row, column, and bold region contains each digit once, where N is the number of rows and columns in the puzzle. (Usually N = 9.).\r\n\r\nJust like the original, this app is made for android using Kotlin.","BaseURL":"./sudoku/","Href":"https://github.com/Ech0-jp/Sudoku"},{"Images":[],"Title":"Hammerfist","Subtitle":"May 2015 - April 2016","Description":"A game where First-Person Brawling meets Boxercising. Developed in Unity using a Myo Armband as the controller. The player takes control of a descendant of a god to fight creatures that have escaped from their prison.\r\n\r\nI joined a subsidiary of 13AM games during the summer after my first year of game development as an intern. During my 1 year time spent with them, I served as the UI programmer that helped with gameplay mechanics. After the 3rd years graduated and left the team, I took over as the AI programmer as well.","BaseURL":null,"Href":""},{"Images":["match3_game.png","match3_menu.png","match3_win.png"],"Title":"Match 3","Subtitle":"DESN1083 - Assignment 1 - Mar 1, 2014","Description":"A game with the concept of the well known game; bejeweled. The player is supposed to swap one gem with an adjacent one to form a chain of three or more gems of the same color. When this occurs the gems disappear and a new bunch of gems which are randomly generated drop from above to fill up the empty space. When falling gems automatically line-up a chain reaction is caused. The theme I went with on this game was an anime that i really enjoyed watching called K-On!.","BaseURL":"./match3/","Href":"https://www.dropbox.com/s/llyroy5acq07lw4/K-On%21%20Match%203.rar?dl=0"},{"Images":["frogger_boss1.png","frogger_boss2.png","frogger_bossend.png","frogger_bossstart.png","frogger_maingame.png"],"Title":"Frogger","Subtitle":"DESN1083 - Assignment 2 - Mar 20, 2014","Description":"Based off of the game made in 1981 by Konami, is a game where the player plays as a frog and has 3, 5, or 7 lives. The player must cross a series of roads filled with traffic and rivers that have logs to jump on to get across. At the end of the map, there are a few pads (or safe zones) that the player must reach. Once all the safe zones are filled, the level is completed.\r\n\r\nThe theme that I went with for this remake is based off of an anime that I have watched called \"Madoka Magica\". A lot of the features that are in the original frogger are changed in this game, but it still carries the core concept (cross dangerous elements to reach a safe spot at the end of the map to complete the level and try for a high score).","BaseURL":"./frogger/","Href":"https://github.com/Ech0-jp/Madoka-Magica-Frogger"},{"Images":["asteroids_game1.png","asteroids_menu.png","asteroids-game2.png"],"Title":"Asteroids","Subtitle":"DESN1083 - Assignment 3 - Dec 14, 2013","Description":"A remake of the tradition game: Asteroids. A game where you play as a space ship that is flying in an asteroid belt. You, the player, must survive as long as humanly possible while astroids are flying around you and enemy space ships try to blow you up. There wasn't much was changed from the original asteroids besides a major graphic overhaul and some added gameplay components. This was my first game made in Unity.","BaseURL":"./asteroids/","Href":"https://github.com/Ech0-jp/Asteroids"}]